In [9]:
import pandas as pd
from py_files.nadadinada import cust_basket, cust_info, prod_map

In [10]:
cust_info.head(3)

,Unnamed: 0,customer_id,customer_name,customer_gender,customer_birthdate,kids_home,teens_home,number_complaints,distinct_stores_visited,lifetime_spend_groceries,...,lifetime_spend_fish,lifetime_spend_hygiene,lifetime_spend_videogames,lifetime_spend_petfood,lifetime_total_distinct_products,percentage_of_products_bought_promotion,year_first_transaction,loyalty_card_number,latitude,longitude
0,0,39634,David Frink,male,05/15/1964 10:34 PM,1.0,1.0,1.0,2.0,18306.0,...,4056.0,2174.0,3946.0,2514.0,32.0,0.072206,2010.0,NaN,38.735637,-9.149071
1,1,43460,Belinda Terry,female,03/26/1988 11:06 PM,1.0,0.0,1.0,2.0,5015.0,...,1925.0,2115.0,1028.0,1987.0,2566.0,0.206227,2014.0,NaN,38.762702,-9.160802
2,2,23937,Evelyn Calico,female,04/13/1969 06:07 PM,0.0,1.0,1.0,3.0,3097.0,...,2347.0,1306.0,1504.0,2018.0,1282.0,0.136168,2009.0,951127.0,38.717431,-9.165105

In [11]:
cust_basket.head(3)

   invoice_id                                      list_of_goods  customer_id
0     7448187  ['olive oil', 'yogurt cake', 'grated cheese', ...        43134
1     3167314  ['babies food', 'shower gel', 'rice', 'black b...        43134
2    10199712  ['babies food', 'barbecue sauce', 'olive oil',...        43134

In [12]:
prod_map.head(3)

  product_name        category
0    champagne  alcohol_drinks
1      bramble  alcohol_drinks
2   white wine  alcohol_drinks